podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SDHC0_MK21F12.svd.xml
            <register>
               <name>IRQSTAT</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>IRQSTAT</name>
                     <description>Status Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <?ignoreOverlap?>
                  </field>
                  <field>
                     <name>CC</name>
                     <description>Command Complete</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Command incomplete</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Command complete</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TC</name>
                     <description>Transfer Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Transfer incomplete</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transfer complete</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BGE</name>
                     <description>Block Gap Event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No block gap event</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transaction stopped at block gap</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DINT</name>
                     <description>DMA Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BWR</name>
                     <description>Buffer Write Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not ready</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Ready</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BRR</name>
                     <description>Buffer Read Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not ready</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Ready</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CINS</name>
                     <description>Card Insertion</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Card unstable or removed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Card inserted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRM</name>
                     <description>Card Removal</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Card unstable or inserted</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Card removed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CINT</name>
                     <description>Card Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Card Interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Card Interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTOE</name>
                     <description>Command Timeout Error</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Time out</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>Command CRC Error</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CRC Error Generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CEBE</name>
                     <description>Command End Bit Error</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>End Bit Error Generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIE</name>
                     <description>Command Index Error</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CTOE" > <name>DTOE</name> <description>Data Timeout Error</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CIE" > <name>DCE</name> <description>Data CRC Error</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="CIE" > <name>DEBE</name> <description>Data End Bit Error</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="CIE" > <name>AC12E</name> <description>Auto CMD12 Error</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="CIE" > <name>DMAE</name> <description>DMA Error</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IRQSTATEN</name>
               <description>Interrupt Status Enable Register</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0x117F013F</resetValue>
               <fields>
                  <field>
                     <name>IRQSTATEN</name>
                     <description>Status Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <?ignoreOverlap?>
                  </field>
                  <field>
                     <name>CCSEN</name>
                     <description>Command Complete Status Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CCSEN" > <name>TCSEN</name> <description>Transfer Complete Status Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>BGESEN</name> <description>Block Gap Event Status Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DINTSEN</name> <description>DMA Interrupt Status Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>BWRSEN</name> <description>Buffer Write Ready Status Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>BRRSEN</name> <description>Buffer Read Ready Status Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CINSEN</name> <description>Card Insertion Status Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CRMSEN</name> <description>Card Removal Status Enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CINTSEN</name> <description>Card Interrupt Status Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CTOESEN</name> <description>Command Timeout Error Status Enable</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CCESEN</name> <description>Command CRC Error Status Enable</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CEBESEN</name> <description>Command End Bit Error Status Enable</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>CIESEN</name> <description>Command Index Error Status Enable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DTOESEN</name> <description>Data Timeout Error Status Enable</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DCESEN</name> <description>Data CRC Error Status Enable</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DEBESEN</name> <description>Data End Bit Error Status Enable</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>AC12ESEN</name> <description>Auto CMD12 Error Status Enable</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="CCSEN" > <name>DMAESEN</name> <description>DMA Error Status Enable</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IRQSIGEN</name>
               <description>Interrupt Signal Enable Register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>IRQSIGEN</name>
                     <description>Status Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <?ignoreOverlap?>
                  </field>
                  <field>
                     <name>CCIEN</name>
                     <description>Command Complete Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CCIEN" > <name>TCIEN</name> <description>Transfer Complete Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>BGEIEN</name> <description>Block Gap Event Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DINTIEN</name> <description>DMA Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>BWRIEN</name> <description>Buffer Write Ready Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>BRRIEN</name> <description>Buffer Read Ready Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CINSIEN</name> <description>Card Insertion Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CRMIEN</name> <description>Card Removal Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CINTIEN</name> <description>Card Interrupt Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CTOEIEN</name> <description>Command Timeout Error Interrupt Enable</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CCEIEN</name> <description>Command CRC Error Interrupt Enable</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CEBEIEN</name> <description>Command End Bit Error Interrupt Enable</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>CIEIEN</name> <description>Command Index Error Interrupt Enable</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DTOEIEN</name> <description>Data Timeout Error Interrupt Enable</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DCEIEN</name> <description>Data CRC Error Interrupt Enable</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DEBEIEN</name> <description>Data End Bit Error Interrupt Enable</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>AC12EIEN</name> <description>Auto CMD12 Error Interrupt Enable</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="CCIEN" > <name>DMAEIEN</name> <description>DMA Error Interrupt Enable</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
